
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Код,
	|	Контрагенты.Наименование
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты";
	
	ПроверитьКорректность();
КонецПроцедуры

&НаСервере
Процедура ПроверитьКорректность()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоИНННаСервере()
	Сообщить("Заполнили");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	ЗаполнитьПоИНННаСервере();
КонецПроцедуры
